{"basics":{"name":"Miles Douglas Gorman","email":"Miles.D.Gorman@gmail.com","citizenship":"Australian and American","Location":"Brisbane, Queensland, Australia"},"education":[{"institution":"The University of Cambridge, United Kingdom","studyType":"Master of Advanced Study","area":"Applied Mathematics","startDate":"2022","endDate":"2023"},{"institution":"The University of Queensland, Australia","studyType":"Bachelor of Advanced Science (Honours)","area":"Physics","startDate":"2018","endDate":"2022"}],"certificates":[],"publications":[],"languages":[],"interests":[],"references":[],"projects":[{"name":"A Syndrome-Extraction-Gadget Family That Unifies Shor-, Steane-, and Kinll-Style Error Correction","summary":"Proposed a family of fault-tolerant syndrome extraction gadgets with circuit depths and qubit counts between or equal to those of Shor-, Steane-, and Knill-style gadgets. Currently preparing for publication.","startDate":"2023","endDate":"present"},{"name":"A Review of Syndrome Extraction in Quantum Error Correction","summary":"A review of the various techniques for fault-tolerant syndrome extraction: naive syndrome extraction, Shor syndrome extraction, Steane syndrome extraction, Knill syndrome extraction, flag-basted syndrome extraction, hybrid syndrome extraction techniques, measurement-based quantum computing, and fusion-based quantum computing - as they pertain to syndrome extraction. Currently preparing for publication.","startDate":"2022","endDate":"present"},{"name":"Ancilla-Free Preparation of Quantum Error-Correcting Codes","summary":"Designed an algorithm that finds, for arbitrary stabilizer codes, ancilla-free encoding circuits with significantly reduced overheads compared to the literature’s most prominent method. This work served as the basis for my honours thesis and is now being prepared for publication.","url":"/assets/pdf/UQ_Thesis.pdf","startDate":"2021","endDate":"present"},{"name":"Fault-Tolerant Quantum Computation","summary":"Essay on the threshold theorem and the overhead of fault-tolerant quantum computing.","url":"/assets/pdf/Part_iii_Essay.pdf","startDate":"2022","endDate":"2023"},{"name":"Fusion-Based Foliated Quantum Codes","summary":"Proposed an algorithm that generalizes the construction of arbitrary foliated CSS codes by fusing resource states.","url":"/assets/pdf/Fusion_based_Foliated_Quantum_Codes.pdf","endDate":"2021"},{"name":"Union-Find Decoding on the XZZX Surface Code","summary":"Implemented and benchmarked the union-find decoder on the XZZX surface code and proposed a modification to the decoder that could offer improved thresholds.","endDate":"2021"},{"name":"An Introduction to Quantum Error Correction and Decoding Algorithms","summary":"A review of quantum error correction with an emphasis on decoding.","endDate":"2021"},{"name":"Fault-Tolerant Error Correction Using Optimized Linear Codes ","summary":"Optimized the number of measurements required for fault-tolerant syndrome extraction on a classical code and numerically simulated the scheme’s performance.","endDate":"2020"}],"skills":[]}